CSI API ETABS v1
cPropFrameSDShape.GetReinfRectangular Method
 Retrieves property data for a rectangular reinforcing shape in a section designer section
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetReinfRectangular(
	string Name,
	string ShapeName,
	ref double XCenter,
	ref double YCenter,
	ref double H,
	ref double W,
	ref double Rotation,
	ref string MatRebar
)
Function GetReinfRectangular (
	Name As String,
	ShapeName As String,
	ByRef XCenter As Double,
	ByRef YCenter As Double,
	ByRef H As Double,
	ByRef W As Double,
	ByRef Rotation As Double,
	ByRef MatRebar As String
) As Integer
Dim instance As cPropFrameSDShape
Dim Name As String
Dim ShapeName As String
Dim XCenter As Double
Dim YCenter As Double
Dim H As Double
Dim W As Double
Dim Rotation As Double
Dim MatRebar As String
Dim returnValue As Integer
returnValue = instance.GetReinfRectangular(Name,
	ShapeName, XCenter, YCenter, H, W,
	Rotation, MatRebar)
int GetReinfRectangular(
	String^ Name,
	String^ ShapeName,
	double% XCenter,
	double% YCenter,
	double% H,
	double% W,
	double% Rotation,
	String^% MatRebar
)
abstract GetReinfRectangular :
        Name : string *
        ShapeName : string *
        XCenter : float byref *
        YCenter : float byref *
        H : float byref *
        W : float byref *
        Rotation : float byref *
        MatRebar : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame section property that is a section designer section
ShapeName
Type: System.String
 The name of a rectangular reinforcing shape in the section designer section
XCenter
Type: System.Double
 The X-coordinate of the center of the shape in the section designer coordinate system. [L]
YCenter
Type: System.Double
 The Y-coordinate of the center of the shape in the section designer coordinate system. [L]
H
Type: System.Double
 The section depth. [L]
W
Type: System.Double
 The top flange width. [L]
Rotation
Type: System.Double
 The counter clockwise rotation of the shape from its default orientation. [deg
MatRebar
Type: System.String
 The material property for the reinforcing steel
Return Value
Type: Int32
 Returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value
Remarks
See Also
Reference
cPropFrameSDShape Interface
ETABSv1 Namespace